app/controllers/quips_controller.rb

SELECT * FROM "quips" WHERE ("quips"."id" = 1)
---
  def show
    @quip = Quip.find(params[:id])

SELECT * FROM "quips" WHERE ("quips"."id" = 2)
---
  def edit
    @quip = Quip.find(params[:id])

INSERT INTO "quips" ("updated_at", "body", "author", "created_at") VALUES('2009-02-03 05:56:35', 'Testing...testing...1..2..3', 'Matthew Anderson', '2009-02-03 05:56:35')
---
  def create
    @quip = Quip.new(params[:quip])

    respond_to do |format|
      if @quip.save

SELECT * FROM "quips" WHERE ("quips"."id" = 1)
UPDATE "quips" SET "body" = 'This is, like, a whole new level of customer service I just experienced. I think I need some peyote and some "alone time" just to unscramble my brain.', "updated_at" = '2009-02-17 05:23:47' WHERE "id" = 3
---
  def update
    @quip = Quip.find(params[:id])

    respond_to do |format|
      if @quip.update_attributes(params[:quip])

SELECT * FROM "quips" WHERE ("quips"."id" = 1)
DELETE FROM "quips" WHERE "id" = 1
---
  def destroy
    @quip = Quip.find(params[:id])
    @quip.destroy