app/controllers/users_controller.rb

  def create
    cookies.delete :auth_token
    # protects against session fixation attacks, wreaks havoc with
    # request forgery protection.
    # uncomment at your own risk
    # reset_session
    @user = User.new(params[:user])
    @user.save
---
INSERT INTO "users" ("salt", "updated_at", "crypted_password", "remember_token_expires_at", "remember_token", "login", "email", "created_at") VALUES('db42d6a50aecc8a8493188834d6ae640474bb80f', '2009-02-03 06:44:00', 'b7ca94652b4237654ae188af5f6d050e1ae07440', NULL, NULL, 'manderson', 'manderson@onehub.com', '2009-02-03 06:44:00')